<?php
/**
 * The template for displaying archive pages
 *
 * @link https://developer.wordpress.org/themes/basics/template-hierarchy/
 *
 * @package abbis
 */

get_header();
?>

	<div class="crumbs">
		<div class="container">
			<?php if ( function_exists( 'dimox_breadcrumbs' ) ) dimox_breadcrumbs(); ?>
		</div>
	</div>

	<section class="result">
		<div class="container">
			<h2 class="result__title h2">Результаты поиска</h2>
			<form action="" class="result__form">
				<input type="text" placeholder="Искать..">
				<button><a href="#"><svg width="20" height="20" fill="none" xmlns="http://www.w3.org/2000/svg"><path d="M9.02 0c4.973 0 9.02 4.046 9.02 9.02a8.965 8.965 0 01-1.387 4.799l2.76 2.76a2.004 2.004 0 11-2.835 2.834l-2.76-2.76a8.966 8.966 0 01-4.798 1.386C4.046 18.04 0 13.993 0 9.02S4.046 0 9.02 0zm0 16.035a7.023 7.023 0 007.015-7.015A7.023 7.023 0 009.02 2.004 7.023 7.023 0 002.004 9.02a7.023 7.023 0 007.016 7.015z" fill="#FF8515"/></a></svg></button>
				<div class="result__form_number">Найдено: <span>3</span></div>
			</form>

			<div class="result__list">
				<div class="result__item">
					<h3 class="h3"><a href="#">С 24 ноября 2020 года Положение ЦБ РФ № 595-П «О платежной системе Банка России» утратит силу. Вместо него будет действовать Положение № <b>732-П.</b></a></h3>
					<div class="result__text">
						<p>13 ноября 2020 года Банк России официально опубликовал на своем сайте новое Положение «О платежной системе Банка России» № <b>732-П</b> от 24 сентября 2020 года, которое вступает в силу с 24 ноября 2020 года (за исключением отдельных норм, вступающих в силу в иные сроки). Новое ...</p>
					</div>
					<div class="result__edit">
						<a href="#">
							<svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px"
							width="48" height="48"
							viewBox="0 0 172 172"
							style=" fill:#000000;"><g fill="none" fill-rule="nonzero" stroke="none" stroke-width="1" stroke-linecap="butt" stroke-linejoin="miter" stroke-miterlimit="10" stroke-dasharray="" stroke-dashoffset="0" font-family="none" font-weight="none" font-size="none" text-anchor="none" style="mix-blend-mode: normal"><path d="M0,172v-172h172v172z" fill="none"></path><path d="M86,172c-47.49649,0 -86,-38.50351 -86,-86v0c0,-47.49649 38.50351,-86 86,-86v0c47.49649,0 86,38.50351 86,86v0c0,47.49649 -38.50351,86 -86,86z" fill="#ff8515"></path><g fill="#ffffff"><path d="M86.02855,32.39333c-1.59727,-0.00208 -3.21121,0.41294 -4.77815,1.27544l-47.66729,28.31673c-0.74004,0.43779 -1.18978,1.23508 -1.18978,2.09401v9.74667c0,1.34669 1.08984,2.42715 2.43667,2.42715h7.31v43.86c-5.37542,0 -9.74667,4.37179 -9.74667,9.74667v7.31c0,1.34669 1.08984,2.43667 2.43667,2.43667h102.34c1.34683,0 2.43667,-1.08997 2.43667,-2.43667v-7.31c0,-5.37487 -4.37125,-9.74667 -9.74667,-9.74667v-43.86h7.31c1.34683,0 2.43667,-1.08046 2.43667,-2.42715v-9.74667c0,-0.85893 -0.44974,-1.65622 -1.18978,-2.09401l-47.66729,-28.30721c-0.02141,-0.01428 -0.04521,-0.02618 -0.06662,-0.03807c-1.48128,-0.82086 -3.05714,-1.24481 -4.65442,-1.24689zM85.99048,37.26666c0.78049,-0.00178 1.55385,0.20107 2.30341,0.60917l46.43944,27.58383v5.92034h-97.46667v-5.92034l46.40137,-27.56479c0.75908,-0.41761 1.54196,-0.62642 2.32245,-0.6282zM85.99048,47.00381c-5.3778,0 -9.74667,4.37839 -9.74667,9.75618c0,5.3778 4.36887,9.75618 9.74667,9.75618c5.3778,0 9.75618,-4.37839 9.75618,-9.75618c0,-5.3778 -4.37838,-9.75618 -9.75618,-9.75618zM85.99048,51.87715c2.6889,0 4.88285,2.19395 4.88285,4.88285c0,2.6889 -2.19395,4.88285 -4.88285,4.88285c-2.6889,0 -4.87333,-2.19395 -4.87333,-4.88285c0,-2.6889 2.18443,-4.88285 4.87333,-4.88285zM47.01333,76.25333h9.74667v43.86h-9.74667zM61.63333,76.25333h14.62v43.86h-14.62zM81.12667,76.25333h9.74667v43.86h-9.74667zM95.74667,76.25333h14.62v43.86h-14.62zM115.24,76.25333h9.74667v43.86h-9.74667zM42.14,124.98666h2.43667h82.84667h2.43667c2.68652,0 4.87333,2.18681 4.87333,4.87333v4.87333h-97.46667v-4.87333c0,-2.68652 2.18681,-4.87333 4.87333,-4.87333z"></path></g><path d="M86,172c-47.49649,0 -86,-38.50351 -86,-86v0c0,-47.49649 38.50351,-86 86,-86v0c47.49649,0 86,38.50351 86,86v0c0,47.49649 -38.50351,86 -86,86z" fill="none"></path><path d="M86,168.56c-45.59663,0 -82.56,-36.96337 -82.56,-82.56v0c0,-45.59663 36.96337,-82.56 82.56,-82.56v0c45.59663,0 82.56,36.96337 82.56,82.56v0c0,45.59663 -36.96337,82.56 -82.56,82.56z" fill="none"></path></g></svg>
							Есть ответ регулятора</a>
						<p>Изменено: <span>03.11.2020</span></p>
					</div>
				</div>

				<div class="result__item">
					<h3 class="h3"><a href="#">С 24 ноября 2020 года Положение ЦБ РФ № 595-П «О платежной системе Банка России» утратит силу. Вместо него будет действовать Положение № <b>732-П.</b></a></h3>
					<div class="result__text">
						<p>13 ноября 2020 года Банк России официально опубликовал на своем сайте новое Положение «О платежной системе Банка России» № <b>732-П</b> от 24 сентября 2020 года, которое вступает в силу с 24 ноября 2020 года (за исключением отдельных норм, вступающих в силу в иные сроки). Новое ...</p>
					</div>
					<div class="result__edit">
						<a href="#">
							<svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px"
							width="48" height="48"
							viewBox="0 0 172 172"
							style=" fill:#000000;"><g fill="none" fill-rule="nonzero" stroke="none" stroke-width="1" stroke-linecap="butt" stroke-linejoin="miter" stroke-miterlimit="10" stroke-dasharray="" stroke-dashoffset="0" font-family="none" font-weight="none" font-size="none" text-anchor="none" style="mix-blend-mode: normal"><path d="M0,172v-172h172v172z" fill="none"></path><path d="M86,172c-47.49649,0 -86,-38.50351 -86,-86v0c0,-47.49649 38.50351,-86 86,-86v0c47.49649,0 86,38.50351 86,86v0c0,47.49649 -38.50351,86 -86,86z" fill="#ff8515"></path><g fill="#ffffff"><path d="M86.02855,32.39333c-1.59727,-0.00208 -3.21121,0.41294 -4.77815,1.27544l-47.66729,28.31673c-0.74004,0.43779 -1.18978,1.23508 -1.18978,2.09401v9.74667c0,1.34669 1.08984,2.42715 2.43667,2.42715h7.31v43.86c-5.37542,0 -9.74667,4.37179 -9.74667,9.74667v7.31c0,1.34669 1.08984,2.43667 2.43667,2.43667h102.34c1.34683,0 2.43667,-1.08997 2.43667,-2.43667v-7.31c0,-5.37487 -4.37125,-9.74667 -9.74667,-9.74667v-43.86h7.31c1.34683,0 2.43667,-1.08046 2.43667,-2.42715v-9.74667c0,-0.85893 -0.44974,-1.65622 -1.18978,-2.09401l-47.66729,-28.30721c-0.02141,-0.01428 -0.04521,-0.02618 -0.06662,-0.03807c-1.48128,-0.82086 -3.05714,-1.24481 -4.65442,-1.24689zM85.99048,37.26666c0.78049,-0.00178 1.55385,0.20107 2.30341,0.60917l46.43944,27.58383v5.92034h-97.46667v-5.92034l46.40137,-27.56479c0.75908,-0.41761 1.54196,-0.62642 2.32245,-0.6282zM85.99048,47.00381c-5.3778,0 -9.74667,4.37839 -9.74667,9.75618c0,5.3778 4.36887,9.75618 9.74667,9.75618c5.3778,0 9.75618,-4.37839 9.75618,-9.75618c0,-5.3778 -4.37838,-9.75618 -9.75618,-9.75618zM85.99048,51.87715c2.6889,0 4.88285,2.19395 4.88285,4.88285c0,2.6889 -2.19395,4.88285 -4.88285,4.88285c-2.6889,0 -4.87333,-2.19395 -4.87333,-4.88285c0,-2.6889 2.18443,-4.88285 4.87333,-4.88285zM47.01333,76.25333h9.74667v43.86h-9.74667zM61.63333,76.25333h14.62v43.86h-14.62zM81.12667,76.25333h9.74667v43.86h-9.74667zM95.74667,76.25333h14.62v43.86h-14.62zM115.24,76.25333h9.74667v43.86h-9.74667zM42.14,124.98666h2.43667h82.84667h2.43667c2.68652,0 4.87333,2.18681 4.87333,4.87333v4.87333h-97.46667v-4.87333c0,-2.68652 2.18681,-4.87333 4.87333,-4.87333z"></path></g><path d="M86,172c-47.49649,0 -86,-38.50351 -86,-86v0c0,-47.49649 38.50351,-86 86,-86v0c47.49649,0 86,38.50351 86,86v0c0,47.49649 -38.50351,86 -86,86z" fill="none"></path><path d="M86,168.56c-45.59663,0 -82.56,-36.96337 -82.56,-82.56v0c0,-45.59663 36.96337,-82.56 82.56,-82.56v0c45.59663,0 82.56,36.96337 82.56,82.56v0c0,45.59663 -36.96337,82.56 -82.56,82.56z" fill="none"></path></g></svg>
							Есть ответ регулятора</a>
						<p>Изменено: <span>03.11.2020</span></p>
					</div>
				</div>

				<div class="result__item">
					<h3 class="h3"><a href="#">С 24 ноября 2020 года Положение ЦБ РФ № 595-П «О платежной системе Банка России» утратит силу. Вместо него будет действовать Положение № <b>732-П.</b></a></h3>
					<div class="result__text">
						<p>13 ноября 2020 года Банк России официально опубликовал на своем сайте новое Положение «О платежной системе Банка России» № <b>732-П</b> от 24 сентября 2020 года, которое вступает в силу с 24 ноября 2020 года (за исключением отдельных норм, вступающих в силу в иные сроки). Новое ...</p>
					</div>
					<div class="result__edit">
						<a href="#">
							<svg xmlns="http://www.w3.org/2000/svg" x="0px" y="0px"
							width="48" height="48"
							viewBox="0 0 172 172"
							style=" fill:#000000;"><g fill="none" fill-rule="nonzero" stroke="none" stroke-width="1" stroke-linecap="butt" stroke-linejoin="miter" stroke-miterlimit="10" stroke-dasharray="" stroke-dashoffset="0" font-family="none" font-weight="none" font-size="none" text-anchor="none" style="mix-blend-mode: normal"><path d="M0,172v-172h172v172z" fill="none"></path><path d="M86,172c-47.49649,0 -86,-38.50351 -86,-86v0c0,-47.49649 38.50351,-86 86,-86v0c47.49649,0 86,38.50351 86,86v0c0,47.49649 -38.50351,86 -86,86z" fill="#ff8515"></path><g fill="#ffffff"><path d="M86.02855,32.39333c-1.59727,-0.00208 -3.21121,0.41294 -4.77815,1.27544l-47.66729,28.31673c-0.74004,0.43779 -1.18978,1.23508 -1.18978,2.09401v9.74667c0,1.34669 1.08984,2.42715 2.43667,2.42715h7.31v43.86c-5.37542,0 -9.74667,4.37179 -9.74667,9.74667v7.31c0,1.34669 1.08984,2.43667 2.43667,2.43667h102.34c1.34683,0 2.43667,-1.08997 2.43667,-2.43667v-7.31c0,-5.37487 -4.37125,-9.74667 -9.74667,-9.74667v-43.86h7.31c1.34683,0 2.43667,-1.08046 2.43667,-2.42715v-9.74667c0,-0.85893 -0.44974,-1.65622 -1.18978,-2.09401l-47.66729,-28.30721c-0.02141,-0.01428 -0.04521,-0.02618 -0.06662,-0.03807c-1.48128,-0.82086 -3.05714,-1.24481 -4.65442,-1.24689zM85.99048,37.26666c0.78049,-0.00178 1.55385,0.20107 2.30341,0.60917l46.43944,27.58383v5.92034h-97.46667v-5.92034l46.40137,-27.56479c0.75908,-0.41761 1.54196,-0.62642 2.32245,-0.6282zM85.99048,47.00381c-5.3778,0 -9.74667,4.37839 -9.74667,9.75618c0,5.3778 4.36887,9.75618 9.74667,9.75618c5.3778,0 9.75618,-4.37839 9.75618,-9.75618c0,-5.3778 -4.37838,-9.75618 -9.75618,-9.75618zM85.99048,51.87715c2.6889,0 4.88285,2.19395 4.88285,4.88285c0,2.6889 -2.19395,4.88285 -4.88285,4.88285c-2.6889,0 -4.87333,-2.19395 -4.87333,-4.88285c0,-2.6889 2.18443,-4.88285 4.87333,-4.88285zM47.01333,76.25333h9.74667v43.86h-9.74667zM61.63333,76.25333h14.62v43.86h-14.62zM81.12667,76.25333h9.74667v43.86h-9.74667zM95.74667,76.25333h14.62v43.86h-14.62zM115.24,76.25333h9.74667v43.86h-9.74667zM42.14,124.98666h2.43667h82.84667h2.43667c2.68652,0 4.87333,2.18681 4.87333,4.87333v4.87333h-97.46667v-4.87333c0,-2.68652 2.18681,-4.87333 4.87333,-4.87333z"></path></g><path d="M86,172c-47.49649,0 -86,-38.50351 -86,-86v0c0,-47.49649 38.50351,-86 86,-86v0c47.49649,0 86,38.50351 86,86v0c0,47.49649 -38.50351,86 -86,86z" fill="none"></path><path d="M86,168.56c-45.59663,0 -82.56,-36.96337 -82.56,-82.56v0c0,-45.59663 36.96337,-82.56 82.56,-82.56v0c45.59663,0 82.56,36.96337 82.56,82.56v0c0,45.59663 -36.96337,82.56 -82.56,82.56z" fill="none"></path></g></svg>
							Есть ответ регулятора</a>
						<p>Изменено: <span>03.11.2020</span></p>
					</div>
				</div>

				<div class="pagination">
					<a href="#" class="pagination__prev"></a>

					<div class="pagination__nav">
						<a href="#">1</a>
						<a href="#" class="pagination__active">2</a>
						<a href="#">3</a>
						<a href="#">4</a>
						<span>...</span>
						<a href="#">23</a>
						<a href="#">24</a>
					</div>

					<a href="#" class="pagination__next"></a>
				</div>

				<div class="tag tag--search">
					<div class="tag__list">
						<a href="#">152-ФЗ</a>
						<a href="#">Персональные данные</a>
						<a href="#">Персданные</a>
						<a href="#">ПДН</a>
						<a href="#">161-ФЗ</a>
						<a href="#">НПС</a>
						<a href="#">НСПК</a>
						<a href="#">187-ФЗ</a>
						<a href="#">КИИ</a>
						<a href="#">716-П</a>
						<a href="#">Операционный риск</a>
						<a href="#">Оперриск</a>
						<a href="#">Киберриск</a>
						<a href="#">719-П (замена 382-П)</a>
						<a href="#">382-П</a>
						<a href="#">683-П</a>
						<a href="#">684-П</a>
						<a href="#">672-П</a>
						<a href="#">747-П</a>
						<a href="#">127-ПП</a>
						<a href="#">ISO 27001</a>
						<a href="#">GDPR</a>
						<a href="#">479-ФЗ</a>
					</div>
				</div>

				<button class="btn--answer modal__form">
					Задать вопрос
				</button>
			</div>

			<div class="result__none">
				<div class="result__none_text">
					<p>В поисковой фразе обнаружена ошибка:</p>
					<p class="result__none_color">Пустой поисковый запрос (запрос не содержит букв или цифр).</p>
					<p>Исправьте поисковую фразу и повторите поиск.</p>
				</div>

				<div class="tag tag--search">
					<div class="tag__list">
						<a href="#">152-ФЗ</a>
						<a href="#">Персональные данные</a>
						<a href="#">Персданные</a>
						<a href="#">ПДН</a>
						<a href="#">161-ФЗ</a>
						<a href="#">НПС</a>
						<a href="#">НСПК</a>
						<a href="#">187-ФЗ</a>
						<a href="#">КИИ</a>
						<a href="#">716-П</a>
						<a href="#">Операционный риск</a>
						<a href="#">Оперриск</a>
						<a href="#">Киберриск</a>
						<a href="#">719-П (замена 382-П)</a>
						<a href="#">382-П</a>
						<a href="#">683-П</a>
						<a href="#">684-П</a>
						<a href="#">672-П</a>
						<a href="#">747-П</a>
						<a href="#">127-ПП</a>
						<a href="#">ISO 27001</a>
						<a href="#">GDPR</a>
						<a href="#">479-ФЗ</a>
					</div>
				</div>

				<button class="btn--answer">
					Задать вопрос
				</button>
			</div>

		</div>
	</section>

<?php
get_sidebar();
get_footer();
